Table of Contents
 Class LibraryItem
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
Identification of an item in IDEA StatiCa MPRL (material and product range library)
[DataContract]
public class LibraryItem
Inheritance
object
LibraryItem
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 Group
[DataMember]
public string Group { get; set; }
Property Value
string
 GroupId
[DataMember]
public string GroupId { get; set; }
Property Value
string
 Identifier
[DataMember]
public string Identifier { get; set; }
Property Value
string
 Name
[DataMember]
public string Name { get; set; }
Property Value
string
 Edit this page